backend-api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin_dipa'
 LIMIT 1
---
    public function login()
    {
        // 1. Ambil data JSON yang dikirim oleh Axios frontend SPA
        $json = $this->request->getJSON();

        // Validasi input awal jika data kosong
        if (empty($json->username) || empty($json->password)) {
            return $this->fail('Username dan password wajib diisi!', 400);
        }

        $username = $json->username;
        $password = $json->password;

        // 2. Cari user berdasarkan username di database
        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

UPDATE `users` SET `token` = '186762cdd806551bfd55945f4d5fde2957127599b1a6ee605b2a4f466535a953'
WHERE `users`.`id` IN ('1')
---
        $generatedToken = bin2hex(random_bytes(32));

        // Simpan token baru tersebut ke kolom `token` di tabel `users` database
        $userModel->update($user['id'], [
            'token' => $generatedToken
        ]);